# Calculadora de Retorno CDI

In [26]:
#Instalação de Pacotes e importação
#!pip install python-bcb

from datetime import datetime, date
from matplotlib import pyplot as plt
import numpy as np
from bcb import sgs

In [27]:
capital = float(input("Digite o capital investido: "))
frequencia = input("Digite a frequência do periodo (Y, M, D): ")
inicio = input('Digite a data inicial maior que 1995/01/01 no formato YYYY/MM/DD: ')
final = input('Digite a data final no seguinte formato YYYY/MM/DD: ')

In [28]:
#Tratamento de datas
data_inicio = datetime.strptime(inicio, '%Y/%m/%d').date()
data_final = datetime.strptime(final, '%Y/%m/%d').date()

In [29]:
#Pegar dados sa SELIC banco central
taxas_selic =sgs.get({"selic":11}, start=data_inicio, end=data_final)
taxas_selic
taxas_selic = taxas_selic / 100

In [30]:
#Calcular o retorno do periodo
capital_acumulado = capital * (1 + taxas_selic["selic"]).cumprod()-1
capital_acumulado

Date
1996-01-02     1000.200000
1996-01-03     1001.398106
1996-01-04     1002.547526
1996-01-05     1003.688228
1996-01-08     1004.830227
                  ...
2024-09-03    42826.117289
2024-09-04    42842.935498
2024-09-05    42859.760312
2024-09-06    42876.591732
2024-09-09    42893.429762
Name: selic, Length: 7204, dtype: float64

In [33]:
capital_com_frequencia = capital_acumulado.resample(frequencia).last()
capital_com_frequencia

Date
1996-01-31     1024.764965
1996-02-29     1048.885472
1996-03-31     1072.201557
1996-04-30     1094.395862
1996-05-31     1116.443476
                  ...
2024-05-31    41714.207404
2024-06-30    42043.063805
2024-07-31    42424.454902
2024-08-31    42792.500674
2024-09-30    42893.429762
Freq: ME, Name: selic, Length: 345, dtype: float64

In [38]:
#Filtrar data da selic espefica
data_inicial_2  = date(2000,1,1)
data_final_2 = date(2022,3,3)
selic_questao_2 =sgs.get({"selic":11}, start=data_inicial_2, end=data_final_2) / 100
selic_questao_2

               selic
Date
2000-01-03  0.000692
2000-01-04  0.000692
2000-01-05  0.000692
2000-01-06  0.000693
2000-01-07  0.000693
...              ...
2022-02-23  0.000402
2022-02-24  0.000402
2022-02-25  0.000402
2022-03-02  0.000402
2022-03-03  0.000402

[5568 rows x 1 columns]

In [40]:
#Calcular rentabilidade de 500 dias
janela_500_dias = ((1 + selic_questao_2).rolling(window= 500).apply(np.prod)-1)
janela_500_dias

               selic
Date
2000-01-03       NaN
2000-01-04       NaN
2000-01-05       NaN
2000-01-06       NaN
2000-01-07       NaN
...              ...
2022-02-23  0.080921
2022-02-24  0.081180
2022-02-25  0.081440
2022-03-02  0.081700
2022-03-03  0.081960

[5568 rows x 1 columns]

In [47]:

janela_500_dias= janela_500_dias.reset_index()
janela_500_dias

      level_0  index       Date     selic data_inicial
0           0      0 2001-12-31  0.377688          NaT
1           1      1 2002-01-02  0.377688          NaT
2           2      2 2002-01-03  0.377689          NaT
3           3      3 2002-01-04  0.377689          NaT
4           4      4 2002-01-07  0.377688          NaT
...       ...    ...        ...       ...          ...
5064     5064   5064 2022-02-23  0.080921   2020-02-28
5065     5065   5065 2022-02-24  0.081180   2020-03-02
5066     5066   5066 2022-02-25  0.081440   2020-03-03
5067     5067   5067 2022-03-02  0.081700   2020-03-04
5068     5068   5068 2022-03-03  0.081960   2020-03-05

[5069 rows x 5 columns]

In [49]:

janela_500_dias["data_inicial"]= janela_500_dias["Date"].shift(500)
janela_500_dias

      level_0  index       Date     selic data_inicial
0           0      0 2001-12-31  0.377688          NaT
1           1      1 2002-01-02  0.377688          NaT
2           2      2 2002-01-03  0.377689          NaT
3           3      3 2002-01-04  0.377689          NaT
4           4      4 2002-01-07  0.377688          NaT
...       ...    ...        ...       ...          ...
5064     5064   5064 2022-02-23  0.080921   2020-02-28
5065     5065   5065 2022-02-24  0.081180   2020-03-02
5066     5066   5066 2022-02-25  0.081440   2020-03-03
5067     5067   5067 2022-03-02  0.081700   2020-03-04
5068     5068   5068 2022-03-03  0.081960   2020-03-05

[5069 rows x 5 columns]

In [50]:
janela_500_dias =janela_500_dias.dropna()
janela_500_dias

      level_0  index       Date     selic data_inicial
500       500    500 2003-12-22  0.464659   2001-12-31
501       501    501 2003-12-23  0.464525   2002-01-02
502       502    502 2003-12-24  0.464391   2002-01-03
503       503    503 2003-12-26  0.464258   2002-01-04
504       504    504 2003-12-29  0.464124   2002-01-07
...       ...    ...        ...       ...          ...
5064     5064   5064 2022-02-23  0.080921   2020-02-28
5065     5065   5065 2022-02-24  0.081180   2020-03-02
5066     5066   5066 2022-02-25  0.081440   2020-03-03
5067     5067   5067 2022-03-02  0.081700   2020-03-04
5068     5068   5068 2022-03-03  0.081960   2020-03-05

[4569 rows x 5 columns]

In [54]:
maior_retorno = janela_500_dias["selic"].max()
maior_retorno

0.4646590818944092

In [56]:
gabarito = janela_500_dias[janela_500_dias["selic"] == maior_retorno]
gabarito

     level_0  index       Date     selic data_inicial
500      500    500 2003-12-22  0.464659   2001-12-31